Конфигурация отчетов/DataProcessors/МенюАдминистратора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>МенюАдминистратора</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Заведение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация отчетов/Enums/Заведение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Заведение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заболотного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паустовского</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Таирово</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Филатово</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дерибасовская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Торговая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Люстдорф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Администратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПицерияЗаболотного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бухгалтерия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кондитерка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черноморск</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/DataProcessors/МенюАдминистратора/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ОткрытьОтчетНаСервере()
	// Вставити вміст обробника.
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчет(Команда)
	СсылкаНаДокумент = ПоискОтчета(); 	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ",СсылкаНаДокумент);
	Если СсылкаНаДокумент.Пустая() Тогда
		ОткрытьФорму("Документ.ДневнойОтчет.ФормаОбъекта",ПараметрыФормы);		
	Иначе
		ОткрытьФорму("Документ.ДневнойОтчет.ФормаОбъекта",ПараметрыФормы);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоискОтчета()
	Если Объект.Заведение.Пустая() Тогда
		Заведение = ПодготовкаДанных.ПолучениеПользователя();
	Иначе
		Заведение = Объект.Заведение;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДневнойОтчет.Ссылка КАК Ссылка,
		|	ДневнойОтчет.ДатаСмены КАК ДатаСмены,
		|	ДневнойОтчет.Заведение КАК Заведение
		|ИЗ
		|	Документ.ДневнойОтчет КАК ДневнойОтчет
		|ГДЕ
		|	ДневнойОтчет.Заведение = &Заведение
		|	И ДневнойОтчет.ДатаСмены = &ДатаСмены";
	
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаОтчета);
	Запрос.УстановитьПараметр("Заведение", Заведение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка; 
	КонецЦикла;
	
	Возврат Документы.ДневнойОтчет.ПустаяСсылка();
	
	
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ДатаОтчета = ТекущаяДата();
	Пользователь = ПодготовкаДанных.ПолучениеПользователя(); 
	Если Пользователь = Перечисления.Заведение.Администратор ИЛИ Пользователь = Перечисления.Заведение.Паустовского Тогда
		Элементы.Заведение.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПрограму(Команда)
	ПрекратитьРаботуСистемы(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Перебор(Команда)
	
КонецПроцедуры
